#პირველ რიგში, მომხმარებელს შემოატანინეთ სთრინგი და ის გაამრავლეთ ხუთზე. შემდეგ შემოატანინეთ რიცხვი და ისიც გაამრავლეთ ხუთზე. ორივე შედეგი დაბეჭდეთ და კომენტარების გამოყენებით აღწერეთ თითოეული. 
#მომხმარებელს შემოვატანინე str. და ვამრავლებ ხუთზე.
name = input("please enter your name:")
print(name * 5)
#მომხმარებლის მიერ შემოტანილი str. გავამრავლე ხუთზე და ტერმინალში დაიბეჭდა ხუთჯერ ნიკა.


#მომხმარებელს შემოვატანინე რიცხვი და ვამრავლებ ხუთზე.
num = input("please enter number:")
print(num * 5)
#მომხმარებლის მიერ შემოტანილი რიცხვი 55 გავამრავლე ხუთზე და ტერმინალში ხუთჯერ დაიბეჭდა 55.