# გამოიყენეთ ყველა კონვერტაციის ფუნქცია და გააკეთეთ თითოეულზე 5-5 მაგალითი, დააკვირდით და გაანალიზეთ როგორ მუშაობს თითოეული ფუნქცია(რა დროს მოგცათ ერორი და რა დროს არა)
#არითმეტიკულ მოქმედებებს ვასრულებ მთელ (int) რიცხვებს შორის.
#შევქმენი ორი ცვლადი სადაც ჩავწერე რა სახის იქნებოდა რიცხვი რომ დაბეჭდვის დროს არ მეწვალა ბევრი.
num_1 = int(77)
num_2 = int(88)
print(num_1 + num_2)
print(num_1 - num_2)
print(num_1 * num_2)
print(num_1 / num_2)
print(num_1 // num_2)
print(num_1 % num_2)


#არითმეტუკულ მოქმედებებს ვასრულებ მთელ (int) რიცხვსა და ათწილადს (float) შორის.
#ვქმნი ორ ცვლადს სადაც შევინახავ რიცხვებს.
num_3 = int(65)
num_4 = float(75)
print(num_3 + num_4)
print(num_3 - num_4)
print(num_3 * num_4)
print(num_3 / num_4)
print(num_3 // num_4)
print(num_3 % num_4)


#არითმეტიკულ მოქმედებებს ვასრულებ ათწილადებს (float) შორის.
#ვქმნი ორ ცვლადს სადაც შევინახავ რიცხვს.
num_5 = float(85)
num_6 = float(95)
print(num_5 + num_6)
print(num_5 - num_6)
print(num_5 * num_6)
print(num_5 / num_6)
print(num_5 // num_6)
print(num_5 % num_6)


#არითმეტიკულ მოქმედებებს ვასრულებ ტექსტურ დოკუმენტსა (str) და მთელ (int) რიცხვს შორის.
#შევქმენი ცვლადი სადაც ჩავწერე რა სახის იქნებოდა რიცხვი რომ დაბეჭდვის დროს არ მეწვალა ბევრი.
num_7 = str(55)
num_8 = int(66)
print(num_7 + num_8)
print(num_7 - num_8)
print(num_7 * num_8)
print(num_7 / num_8)
print(num_7 // num_8)
print(num_7 % num_8)
#ამოაგდო ერორი რადგან ტექსტურ დოკუმენტსა (str) და მთელ (int) რიცხვს შორის ვერ მოხერხდა არითმეტიკული მოქმედების შესრულება.


#არითმეტიკულ მოქმედებებს ვასრულებ ტექსტურ დოკუმენტსა (str) და ათწილადს (float) შორის.
num_9 = str(77)
num_10 = float(8.8)
print(num_9 + num_10)
print(num_9 - num_10)
print(num_9 * num_10)
print(num_9 / num_10)
print(num_9 // num_10)
print(num_9 % num_10)
#ტექსტურ დოკუმენტსა (str) და ათწილადს (float) შორის ვერ მოხერხდა არითმეტიკული მოქმედების შესრულება რადგან ტექსტურ დოკუმენტსა (str) და ათწილადის (float) შეკრება, გაყოფა, გამრავლება და ასე შემდეგ არალოგიკურია.
