# შექმენით პროგრამა სადაც მომხმარებელი შემოიტანს 5 რციხვს, ხოლო ამ 5 რიცხვს შორის გამოიყენეთ ყველა არითმეტიკული ოპერაცია (// და %_იც), საბოლოოდ დაბეჭდეთ შედეგები ტერმინალში + ახსენით თითოეული ნაწილი კოდის რატომ დაწერეთ კონკრეტული ხაზი და რას აკეთებს.
#ვქმნი პროგრამას სადაც მომხმარებელს შეეძლება 5 რიცხვის შემოტანა 
num_1 = str(input("Please enter first number:"))
num_2 = int(input("Please enter second number:"))
num_3 = float(input("Please enter third number:"))
num_4 = int(input("Please enter fourth number:"))
num_5 = float(input("Please enter fifth number:"))


#მომხმარებლის მიერ შემოტანილ 5 რიცხვს გამოვიყენებ არითმეტიკული ოპერაციისთვის.
#მომხარებლის მიერ შემოტანილ რიცხვებს ვკრიბავ მაგრამ ამომიგდო ერორი რადგან ტექსტურ მონაცემს ვუმატებ (str) მთელ (float) რიცხვს და მათი შეკრება არალოგიკურია.
print(num_1 + num_2)
#მომხმარებლის მიერ შემოტანილ რიცხვებს ვაკლებ და ამ ოპერაციამ წარმატებით ჩაიარა რადგან ათწილადს (float) გამოკლებული მთელი (int) რიცხვის გამოკლება შესაძლებელია.
print(num_3 - num_4)
#მომხმარებლის მიერ შემოტანილ ათწილადსა (float) და მთელ (int) რიცხვს შორის მოქმედება შესაძლებელია.
print(num_5 * num_2)
#მომხმარებლის მიერ შემოტანილი რიცხვები ტექსტურ დოკუმენტსა (str) და ათწილადს (float) შორის მოქმედება შეუძლებელია ტექსტურ დოკუმენტს (str) ვერ გავყოფთ ათწილადზე (float).
print(num_1 / num_3)
#მომხმარებლის მიერ შემოტანილ მთელ რიცხვებს შორის გაყოფა შესაძლებელია.
print(num_2 // num_4)
#მომხმარებლის მიერ შემოტანილ რიცხვებს შორის მოქმედება შესაძლებელია.
print(num_2 % num_3)
