# print(5 / 2) # ზუსტი გაყოფა /, 5 / 2 = 2.5
# print(5 // 2) # არაზუსტი გაყოფა(რამდენჯერ მოთავსდება გასაყოფში გამყოფი), 5 // 2 = 2
# print(5 % 2) # ნაშთიანი გაყოფა, 5 % 2 = 1 (მიბრუნებს ნაშთს)
# print(5 / 2) # ზუსტი გაყოფა /, 5 / 2 = 2.5
# print(5 // 2) # არაზუსტი გაყოფა(რამდენჯერ მოთავსდება გასაყოფში გამყოფი), 5 // 2 = 2
# print(5 % 2) # ნაშთიანი გაყოფა, 5 % 2 = 1 (მიბრუნებს ნაშთს)

# int()_ს გადაეცემა ნებისმიერი მონაცემი (თუ მონაცემი არ არის ვალიდური ანუ სწორი) მაგ შემთხვევაში დამიბრუნდება error, ხოლო თუ სწორია მაშინ, int ფუნქცია კონკრეტულ მონაცემს გარდაქმნის მთელ რიცხვად
# float()_ს გადაეცემა ნებისმიერი მონაცემი (თუ მონაცემი არ არის ვალიდური ანუ სწორი) მაგ შემთხვევაში დამიბრუნდება error, ხოლო თუ სწორია მაშინ, int ფუნქცია კონკრეტულ მონაცემს გარდაქმნის ათწილად რიცხვად
# str()_ს გადაეცემა ნებისმიერი მონაცემს გარდაქმნის სტრინგად (ტექსტური მონაცემი "")