#გაკვეთილზე განხილული შედარების ოპერატორებიდან (>, <, ==, >=, <=, !=) თითოეულზე ჩამოწერეთ 5-5 მაგალითი.
#ვასრულებ შედარებებს სადაც ვიყენებ > ნიშანს. შედეგი გამომაქვს ტერმინალში.
print(99 > 77)
print(88 > 66)
print(77 > 55)
print(66 > 44)
print(55 > 33)

#ვასრულებ შედარებებს სადაც ვიყენებ < ნიშანს.შედეგი გამომაქვს ტერმინალში.
print(77 < 99)
print(44 < 88)
print(55 < 66)
print(33 < 44)
print(11 < 22)

#ვასრულებ შედარებებს სადაც ვიყენებ == ნიშანს.შედეგი გამომაქვს ტერმინალში.
print(11 == 11)
print(22 == 22)
print(33 == 33)
print(44 == 44)
print(55 == 55)

#ვასრულებ შედარებებს სადაც ვიყენებ <= ნიშანს.შედეგი გამომაქვს ტერმინალში.
print(11 <= 22)
print(22 <= 33)
print(33 <= 44)
print(44 <= 55)
print(55 <= 66)


#ვასრულებ შედარებებს სადაც ვიყენებ >= ნიშანს.შედეგი გამომაქვს ტერმინალში.
print(33 >= 22)
print(44 >= 33)
print(55 >= 44)
print(66 >= 55)
print(77 >= 66)

#ვასრულებ შედარებებს სადაც ვიყენებ != ნიშანს.შედეგი გამომაქვს ტერმინალში.
print(55 != 22)
print(44 != 33)
print(33 != 44)
print(22 != 55)
print(11 != 66)