#გაკვეთილზე განხილული შედარების ოპერატორებიდან (>, <, ==, >=, <=, !=) თითოეულზე ჩამოწერეთ 5-5 მაგალითი.
#ვასრულებ შედარებებს სადაც ვიყენებ > ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(88 > 56)
print(95 > 79)
print(45 > 35)
print(77 > 67)
print(65 > 50)

#ვასრულებ შედარებებს სადაც ვიყენებ < ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(11 < 22)
print(69 < 89)
print(55 < 78)
print(37 < 40)
print(20 < 30)

#ვასრულებ შედარებებს სადაც ვიყენებ == ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(55 == 55)
print(66 == 66)
print(77 == 77)
print(20 == 20)
print(60 == 60)

#ვასრულებ შედარებებს სადაც ვიყენებ <= ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(23 <= 45)
print(37 <= 86)
print(42 <= 53)
print(56 <= 78)
print(34 <= 57)


#ვასრულებ შედარებებს სადაც ვიყენებ >= ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(22 >= 11)
print(33 >= 22)
print(44 >= 33)
print(55 >= 44)
print(66 >= 55)

#ვასრულებ შედარებებს სადაც ვიყენებ != ნიშანს და ვბეჭდავ შედეგი კი გამოდის ტერმინალში.
print(67 != 35)
print(33 != 22)
print(55 != 65)
print(43 != 57)
print(26 != 62)