#ჩამოწერეთ 10-10 მაგალითი and და or ოპერატორებზე.
#and ოპერატორი. and ოპერატორზე რომ მივიღოთ ტერმინალში true გვჭირდება რომ ორივე შეყვანილი მაგალითი იყოს true.
print(99 > 88 and 77 > 66)
print(55 > 44 and 95 >= 95)
print(33 < 66 and 22 > 11)
print(45 >= 43 and 78 >= 68)
print(43 < 65 and 55 > 34)
print(55 != 44 and 44 > 22)
print(33 < 44 and 22 >= 22)
print(44 == 44 and 33 > 22)
print(55 >= 44 and 66 > 33)
print(66 > 11 and 44 >= 22)

#or ოპერატორი. or ოპერატორზე საჭიროა ერთ-ერთი მათგანი მაინც იყოს true შედეგად კი მივიღებთ true ტერმინალში.
print(57 > 32 or 60 < 70)
print(43 > 33 or 63 <= 24)
print(45 < 57 or 35 > 76)
print(56 >= 54 or 23 <= 17)
print(36 < 54 or 67 < 12)
print(44 != 33 or 96 < 34)
print(24 < 54 or 76 <= 45)
print(44 == 44 or 44 < 33)
print(98 >= 78 or 76 < 53)
print(87 > 34 or 56 <= 34)