#შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში შეინახეთ მშობლის ასაკი. დაბეჭდეთ, თუ 10 წელში რამდენჯერ მეტი იქნება მშობლის ასაკი თქვენსაზე
#პირველი ცვლადი ჩემი ასაკი
my_age = 17
#მეორე ცვლადი მამაჩემის ასაკი
dad_age = 39
#ვბეჭდავ. პირველ ცვლადს ვუმატებ 10
print(my_age + 10)
#ვბეჭდავ. მეორე ცვლადს ვუმატებ 10
print(dad_age + 10)
#ვბეჭდავ. დაბეჭდილ მეორე ცვლადს ვყოფ დაბეჭდილ პირველ ცვლადზე
print((dad_age + 10) / (my_age + 10))

#10 წლის შემდეგ ჩემი მშობლის ასაკი ჩემს ასაკზე 1.8148148148148149 - ჯერ მეტი იქნება